Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Прейскурант
	Движения.Прейскурант.Записывать = Истина;
	Для Каждого ТекСтрокаПрейскурант из Прейскурант Цикл
		Движение = Движения.Прейскурант.Добавить();
		Движение.ВидРабот = ТекСтрокаПрейскурант.ВидРабот;
		Движение.Стоимость = ТекСтрокаПрейскурант.Цена;
		Движение.Период = ЭтотОбъект.Дата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры