&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//TODO: Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.ВзятьЦеныИзАГПС.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаАГПСКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "УстановкаЦенНаРаботы.Прейскурант";
	ПараметрыЗагрузки.Заголовок = НСтр("Ru = Получить Исторические цены");
	ПараметрыЗагрузки.ДополнительныеПараметры = новый Структура("Дата", НачалоГода(Объект.Дата));
	Оповещение = Новый ОписаниеОповещения("ЗавершениеЗагрузкиЦен", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаАГПСКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
КонецПроцедуры
&НаКлиенте
Процедура ЗавершениеЗагрузкиЦен(АдресДанныхВХранилище,ДопПараметры) Экспорт
	Если АдресДанныхВХранилище = Неопределено тогда
		Возврат
	КонецЕсли;
	ЗаполнитьТЧНаСервере(АдресДанныхВХранилище);
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьТЧНаСервере(АдресДанныхВХранилище)
	ЗагрДанные = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);
	Для Каждого строкаданных из ЗагрДанные Цикл
		НоваяСтрока = Объект.Прейскурант.Добавить();
		НоваяСтрока.ВидРабот = строкаданных.ВидРабот;
		НоваяСтрока.Цена = строкаданных.Цена;
		НоваяСтрока.D_START = строкаданных.D_START;
		НоваяСтрока.CODE = строкаданных.CODE;
		НоваяСтрока.V_RABOT = строкаданных.V_RABOT;
	КонецЦикла;
	Модифицированность = Истина; 
КонецПроцедуры